[
    {
        "authors": [
            "J.K. Rowling"
        ],
        "averageRating": 4,
        "categories": [
            "Juvenile Fiction"
        ],
        "description": "All seven eBooks in the multi-award winning, internationally bestselling Harry Potter series, available as one download with stunning cover art by Olly Moss. Enjoy the stories that have captured the imagination of millions worldwide.",
        "googleId": "f280CwAAQBAJ",
        "isEbook": false,
        "isbn10": "1781106460",
        "isbn13": "9781781106464",
        "language": "en",
        "pageCount": 4236,
        "publishedDate": "2015-12-14",
        "publisher": "Pottermore Publishing",
        "smallThumbnail": "http://books.google.com/books/content?id=f280CwAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
        "textSnippet": "All seven eBooks in the multi-award winning, internationally bestselling Harry Potter series, available as one download with stunning cover art by Olly Moss. Enjoy the stories that have captured the imagination of millions worldwide.",
        "thumbnail": "http://books.google.com/books/content?id=f280CwAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "title": "Harry Potter: The Complete Collection (1-7)",
        "webReaderLink": "http://play.google.com/books/reader?id=f280CwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"
    },
    {
        "authors": [
            "J. K. Rowling"
        ],
        "averageRating": 4.5,
        "description": "As featured in the first year set texts reading list in Harry Potter and the Philosopher's Stone, 'Fantastic Beasts and where to find them' is an extensive introduction to the magical beasts that exist in the magical, non-Muggle world. Some of the animals featured in the A-Z you will have already met in the existing Harry Potter books: for example Hippogriff, Flobberworm, Kappa - others you certainly won't: read on to find out exactly what a Chizpurfle is, why there are so few Erumpents, or why one should always beware of the sinister Lethifold…As Albus Dumbledore says in his introduction, this set text book by Newt Scamander has given the perfect grounding to many a Hogwarts student. It will be helpful to all Muggles out there too… On reading the book you will also find that Harry, Ron and (in one instance) Hermione - couldn't resist grafittiing the book, and adding their own personal hand-written opinions. Did you know that : there are 700 ways of committing a foul in Quidditch? The game first began to evolve on Queerditch Marsh? What Bumphing is? That Puddlemere United is oldest team in the Britain and Ireland league? (founded 1163) All this information and much more could be yours once you have read this book: this is all you could ever need to know about the history, the rules - and the breaking of the rules - of the noble wizarding sport of Quidditch.",
        "googleId": "9v1GPQAACAAJ",
        "isEbook": false,
        "isbn10": "0747574510",
        "isbn13": "9780747574514",
        "language": "en",
        "publishedDate": "2004-05",
        "publisher": "Bloomsbury Childrens",
        "smallThumbnail": "http://books.google.com/books/content?id=9v1GPQAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
        "textSnippet": "That Puddlemere United is oldest team in the Britain and Ireland league? (founded 1163) All this information and much more could be yours once you have read this book- this is all you could ever need to know about the history, the rules - ...",
        "thumbnail": "http://books.google.com/books/content?id=9v1GPQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "title": "Harry Potter's School Books",
        "webReaderLink": "http://play.google.com/books/reader?id=9v1GPQAACAAJ&hl=&printsec=frontcover&source=gbs_api"
    },
    {
        "authors": [
            "J. K. Rowling"
        ],
        "averageRating": 5,
        "categories": [
            "Juvenile Fiction"
        ],
        "googleId": "1XP_tQEACAAJ",
        "isEbook": false,
        "isbn10": "133831291X",
        "isbn13": "9781338312911",
        "language": "en",
        "publishedDate": "2018-09-25",
        "publisher": "Harry Potter",
        "smallThumbnail": "http://books.google.com/books/content?id=1XP_tQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
        "thumbnail": "http://books.google.com/books/content?id=1XP_tQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "title": "Harry Potter",
        "webReaderLink": "http://play.google.com/books/reader?id=1XP_tQEACAAJ&hl=&printsec=frontcover&source=gbs_api"
    },
    {
        "authors": [
            "J. K. Rowling"
        ],
        "categories": [
            "Juvenile Fiction"
        ],
        "description": "Rescued from the outrageous neglect of his aunt and uncle, a young boy with a great destiny proves his worth while attending Hogwarts School for Witchcraft and Wizardry.",
        "googleId": "gqX7rQEACAAJ",
        "isEbook": false,
        "isbn10": "0545790352",
        "isbn13": "9780545790352",
        "language": "en",
        "pageCount": 256,
        "publishedDate": "2015-10-06",
        "publisher": "Arthur A. Levine Books",
        "smallThumbnail": "http://books.google.com/books/content?id=gqX7rQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
        "textSnippet": "Rescued from the outrageous neglect of his aunt and uncle, a young boy with a great destiny proves his worth while attending Hogwarts School for Witchcraft and Wizardry.",
        "thumbnail": "http://books.google.com/books/content?id=gqX7rQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "title": "Harry Potter and the Sorcerer's Stone",
        "webReaderLink": "http://play.google.com/books/reader?id=gqX7rQEACAAJ&hl=&printsec=frontcover&source=gbs_api"
    },
    {
        "authors": [
            "J.K. Rowling",
            "John Tiffany",
            "Jack Thorne"
        ],
        "averageRating": 3.5,
        "categories": [
            "Drama"
        ],
        "description": "Based on an original new story by J.K. Rowling, Jack Thorne and John Tiffany, a new play by Jack Thorne, Harry Potter and the Cursed Child is the eighth story in the Harry Potter series and the first official Harry Potter story to be presented on stage. The play received its world premiere in London’s West End on 30th July 2016. It was always difficult being Harry Potter and it isn’t much easier now that he is an overworked employee of the Ministry of Magic, a husband and father of three school-age children. While Harry grapples with a past that refuses to stay where it belongs, his youngest son Albus must struggle with the weight of a family legacy he never wanted. As past and present fuse ominously, both father and son learn the uncomfortable truth: sometimes, darkness comes from unexpected places.",
        "googleId": "tcSMCwAAQBAJ",
        "isEbook": false,
        "isbn10": "1781107041",
        "isbn13": "9781781107041",
        "language": "en",
        "pageCount": 320,
        "publishedDate": "2016-07-31",
        "publisher": "Pottermore Publishing",
        "smallThumbnail": "http://books.google.com/books/content?id=tcSMCwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
        "textSnippet": "Based on an original new story by J.K. Rowling, Jack Thorne and John Tiffany, a new play by Jack Thorne, Harry Potter and the Cursed Child is the eighth story in the Harry Potter series and the first official Harry Potter story to be ...",
        "thumbnail": "http://books.google.com/books/content?id=tcSMCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "title": "Harry Potter and the Cursed Child – Parts One and Two (Special Rehearsal Edition)",
        "webReaderLink": "http://play.google.com/books/reader?id=tcSMCwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"
    },
    {
        "authors": [
            "J. K. Rowling"
        ],
        "description": "Harry thinks he's an ordinary boy until he is rescued by an owl, taken to Hogwarts School of Witchcraft and Wizardry, learns to play Quidditch and does battle in a deadly duel. Why? Because he's a wizard himself.",
        "googleId": "zZdRzQEACAAJ",
        "isEbook": false,
        "language": "en",
        "other": "OCLC:655539002",
        "publishedDate": "2005",
        "textSnippet": "Harry thinks he&#39;s an ordinary boy until he is rescued by an owl, taken to Hogwarts School of Witchcraft and Wizardry, learns to play Quidditch and does battle in a deadly duel. Why? Because he&#39;s a wizard himself.",
        "title": "Harry Potter and the Philosopher's Stone",
        "webReaderLink": "http://play.google.com/books/reader?id=zZdRzQEACAAJ&hl=&printsec=frontcover&source=gbs_api"
    },
    {
        "authors": [
            "Monique Peterson"
        ],
        "categories": [
            "Art"
        ],
        "description": "Discover the wands of your favorite Harry Potter characters. In the Harry Potter films, each wand is as unique as the witch or wizard who wields it. Whether talon-shaped like Bellatrix Lestrange’s or simple and elegant like Hermione Granger’s, each wand was designed and crafted by the filmmakers to be a reflection of its owner’s identity. Harry Potter: The Wand Collection is an in-depth visual guide to the many magical characters and wands of the Harry Potter films. Detailed profiles of each wand feature stunning new photography, wand statistics, insights from cast and crew, and other filmmaking secrets from the Warner Bros. archive. This collectible volume is an ideal resource both for wand-wielding fans looking to learn the history behind these beloved items and for a new generation of children eager to start their journey into the wizarding world.",
        "googleId": "FuFoygEACAAJ",
        "isEbook": false,
        "isbn10": "1683839889",
        "isbn13": "9781683839880",
        "language": "en",
        "pageCount": 154,
        "publishedDate": "2020-05-05",
        "publisher": "Insight Editions",
        "smallThumbnail": "http://books.google.com/books/content?id=FuFoygEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
        "textSnippet": "This collectible volume is an ideal resource both for wand-wielding fans looking to learn the history behind these beloved items and for a new generation of children eager to start their journey into the wizarding world.",
        "thumbnail": "http://books.google.com/books/content?id=FuFoygEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "title": "Harry Potter: The Wand Collection [Softcover]",
        "webReaderLink": "http://play.google.com/books/reader?id=FuFoygEACAAJ&hl=&printsec=frontcover&source=gbs_api"
    },
    {
        "authors": [
            "Felicity Baker"
        ],
        "categories": [
            "Juvenile Nonfiction"
        ],
        "description": "The Essential Film Companion for RON WEASLEY that’s perfect for the youngest fans! Relive the magical moments when Ron Weasley proved just as courageous and loyal as his famous best friend, Harry Potter; whether he was facing the Slytherin Quidditch team or a forest of scary giant spiders! This collection of photographs and quotes from all eight HARRY POTTER films takes a closer look at Ron's life, including his time at Hogwarts, family and friends, and dangerous battles against the Dark Lord, Voldemort. The experience of this eBook will be best if viewed on a tablet.",
        "googleId": "HRUvDQAAQBAJ",
        "isEbook": true,
        "isbn10": "1338160230",
        "isbn13": "9781338160239",
        "language": "en",
        "pageCount": 64,
        "publishedDate": "2016-11-18",
        "publisher": "Scholastic Inc.",
        "smallThumbnail": "http://books.google.com/books/content?id=HRUvDQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
        "textSnippet": "This collection of photographs and quotes from all eight HARRY POTTER films takes a closer look at Ron&#39;s life, including his time at Hogwarts, family and friends, and dangerous battles against the Dark Lord, Voldemort.",
        "thumbnail": "http://books.google.com/books/content?id=HRUvDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "title": "Ron Weasley: Cinematic Guide (Harry Potter)",
        "webReaderLink": "http://play.google.com/books/reader?id=HRUvDQAAQBAJ&hl=&printsec=frontcover&source=gbs_api"
    },
    {
        "authors": [
            "Insight Editions"
        ],
        "categories": [
            "Juvenile Nonfiction"
        ],
        "description": "Discover the creatures of the wizarding world in stunning 3D scenes. Revisit the magic of Harry Potter through four intricate, multilayer dioramas that capture beloved moments from the films. From Harry's pulse-pounding battle with the Hungarian Horntail dragon to his encounter with Thestrals in the Forbidden Forest, each pop-up is laser die-cut for precision and gorgeously detailed. Every scene is followed by essential information about the creatures and fun, behind-the-scenes facts from the films. Design to thrill both seasoned Harry Potter fans and younger children, this volume is a treasured keepsake for the whole family.",
        "googleId": "QMcAtAEACAAJ",
        "isEbook": false,
        "isbn10": "1683834003",
        "isbn13": "9781683834007",
        "language": "en",
        "pageCount": 20,
        "publishedDate": "2018-09-04",
        "publisher": "Insight Kids",
        "smallThumbnail": "http://books.google.com/books/content?id=QMcAtAEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
        "textSnippet": "Designed to thrill both seasoned Harry Potter fans and younger children, this volume is a treasured keepsake for the whole family.",
        "thumbnail": "http://books.google.com/books/content?id=QMcAtAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "title": "Harry Potter: Creatures",
        "webReaderLink": "http://play.google.com/books/reader?id=QMcAtAEACAAJ&hl=&printsec=frontcover&source=gbs_api"
    },
    {
        "authors": [
            "Tanis Gray"
        ],
        "categories": [
            "Crafts & Hobbies"
        ],
        "description": "Introducing the first official Harry Potter knitting book – a deluxe guide to creating over 25 authentic Harry Potter knits based on the iconic films. Channel the magic of the Harry Potter films from the screen to your needles with the ultimate knitter’s guide to the Wizarding World. Featuring over 25 magical knits, the book includes patterns for clothing, home projects and keepsakes pulled straight from the movies – and even includes a few iconic costume pieces as seen on-screen. With yarn suggestions based on the true colours used in the films, projects ranging from simple patterns like the Hogwarts house scarves to more complex projects like Mrs Weasley’s Christmas jumper, knit your own wizarding world. Projects: Crafty Creatures: patterns for Hedwig; Cornish Pixie; Fluffy the Three-Headed Dog. Wizarding Wardrobe: patterns for Mrs Weasley's Home-Knit Christmas jumpers; and Hogwarts’ house scarves. Inspired Apparel: clothes and accessories inspired by characters, artefacts and themes from the films such as a Expecto Patronum! mittens and Quidditch socks. Delightful Decor: dress your home with Harry Potter decorative accessories such as Hogwarts House mug cosies and Seven Horcruxes tea towels. A true fan must-have, this book also includes fun facts, original costume sketches, film stills, and other behind-the-scenes treasures. Harry Potter Knitting Magic is sure to have fans everywhere summoning needles, conjuring yarn, and practicing their best knitting wizardry.",
        "googleId": "mulCyQEACAAJ",
        "isEbook": false,
        "isbn10": "1911641921",
        "isbn13": "9781911641926",
        "language": "en",
        "pageCount": 208,
        "publishedDate": "2020-01-28",
        "publisher": "Pavilion",
        "smallThumbnail": "http://books.google.com/books/content?id=mulCyQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
        "textSnippet": "A true fan must-have, this book also includes fun facts, original costume sketches, film stills, and other behind-the-scenes treasures.",
        "thumbnail": "http://books.google.com/books/content?id=mulCyQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "title": "Harry Potter Knitting Magic",
        "webReaderLink": "http://play.google.com/books/reader?id=mulCyQEACAAJ&hl=&printsec=frontcover&source=gbs_api"
    }
]